## 데이터 로드

In [1]:
import pandas as pd

naver_jyp = pd.read_csv('../../../data/Naver/naver_jyp.csv')

In [2]:
naver_jyp.head()

       period     ratio title
0  2023-01-01   9.80470   JYP
1  2023-01-02  11.63279   JYP
2  2023-01-03  11.41989   JYP
3  2023-01-04  11.24957   JYP
4  2023-01-05  10.17940   JYP

## period 변수 변환
- datetime 형식으로 변환 
- 변수명 'date'로 변경

In [3]:
# 변수명 변경
naver_jyp.rename(columns={'period': 'date'}, inplace=True)

# 변수 형식 변경
naver_jyp['date'] = pd.to_datetime(naver_jyp['date'])
naver_jyp.head() # 확인

        date     ratio title
0 2023-01-01   9.80470   JYP
1 2023-01-02  11.63279   JYP
2 2023-01-03  11.41989   JYP
3 2023-01-04  11.24957   JYP
4 2023-01-05  10.17940   JYP

## title 변수에 따라 데이터프레임 분할

- 이 검색량 데이터의 그룹은 5개이다. 
- 'JYP', 'STRAYKIDS', 'TWICE', 'NMIXX', 'DAY6'

In [4]:
naver_jyp['title'].unique()

array(['JYP', 'STRAYKIDS', 'TWICE', 'NMIXX', 'DAY6'], dtype=object)

In [5]:
df1 = naver_jyp[naver_jyp['title'] == 'JYP']
df2 = naver_jyp[naver_jyp['title'] == 'STRAYKIDS']
df3 = naver_jyp[naver_jyp['title'] == 'TWICE']
df4 = naver_jyp[naver_jyp['title'] == 'NMIXX']
df5 = naver_jyp[naver_jyp['title'] == 'DAY6']

In [6]:
df1.head()

        date     ratio title
0 2023-01-01   9.80470   JYP
1 2023-01-02  11.63279   JYP
2 2023-01-03  11.41989   JYP
3 2023-01-04  11.24957   JYP
4 2023-01-05  10.17940   JYP

In [7]:
df2.head()

          date     ratio      title
181 2023-01-01  76.16384  STRAYKIDS
182 2023-01-02  25.10503  STRAYKIDS
183 2023-01-03  20.54047  STRAYKIDS
184 2023-01-04  19.83365  STRAYKIDS
185 2023-01-05  21.39491  STRAYKIDS

In [8]:
# 인덱스를 0부터 시작하는 정수로 리셋
df1.reset_index(drop=True, inplace=True)
df2.reset_index(drop=True, inplace=True)
df3.reset_index(drop=True, inplace=True)
df4.reset_index(drop=True, inplace=True)
df5.reset_index(drop=True, inplace=True)

## 날짜별 검색량 총합 구하기

In [9]:
merged_df = pd.DataFrame()

In [10]:
merged_df['date'] = df1['date']

In [11]:
merged_df['ratio_sum'] = df1['ratio']+df2['ratio']+df3['ratio']+df4['ratio']+df5['ratio']

In [12]:
merged_df

          date  ratio_sum
0   2023-01-01  185.23899
1   2023-01-02   91.75938
2   2023-01-03   85.53988
3   2023-01-04   82.35776
4   2023-01-05   86.81160
..         ...        ...
176 2023-06-26   86.26091
177 2023-06-27   88.10603
178 2023-06-28   95.75902
179 2023-06-29   90.97308
180 2023-06-30   93.72655

[181 rows x 2 columns]

In [13]:
# csv 파일로 저장 
merged_df.to_csv('../../../data/Naver/naver_preprocessed_jyp.csv',index = False)